{
  "0": {
    "name": "Erik the Red",
    "info": "Erik the Red is a figure who embodies the Vikings' bloodthirsty reputation more completely than most. Ultimately, Erik ended up founding Greenland, but that was only after he'd been banished from Iceland for murdering several men.\nHis father had previously been exiled from Norway - Erik's birthplace - for manslaughter, so violence and exile clearly ran in the family. Erik (real name Erik Thorvaldsson) owed his epithet to his violent temperament and flowing red hair.",
    "image": "https://i2.wp.com/www.military-history.org/wp-content/uploads/2015/03/Erik-the-red.jpg"
  },
  "1": {
    "name": "Leif Erikson",
    "info": "As claims to fame go, Leif Erikson's isn't half bad. Leif is generally considered to have been the first European to set foot in North America, a full 500 years before Christopher Columbus. The son of Erik the Red, Leif is thought to have arrived in the New World in around 1000, having ventured off course en route to Greenland. His crew set up camp in a place he dubbed \"Vinland\", thought to be Newfoundland.",
    "image": "https://bloximages.chicago2.vip.townnews.com/lacrossetribune.com/content/tncms/assets/v3/editorial/0/7b/07b95bcf-b7d2-54a7-9cdd-f9daa2d4c81b/55f2ceaf06fc6.image.jpg"
  },
  "2": {
    "name": "Freydís Eiríksdóttir",
    "info": "A daughter of Erik the Red, Freydís proved she was just as much her father's daughter as her brother, Leif Erikson, was his son. Legend has it that, while exploring North America with her brother, she singlehandedly chased off natives with a sword - while pregnant.",
    "image": "https://cdn.shopify.com/s/files/1/1879/3511/articles/freydis_1024x1024.jpg"
  },
  "3": {
    "name": "Ragnar Lothbrok",
    "info": "Arguably the most famous Viking warrior of them all, not least for his role as the leading protagonist in Vikings, the History Channel's popular drama. Ragnar's fame was well-established before the television show, however, thanks to the prominent role he plays in the stories written down by the Vikings known as \"sagas\".\nIn these sagas, which were based on real people and events, Ragnar's many 9th century raids on Francia and Anglo-Saxon England earn him a legendary status that his nickname, \"Shaggy Breechesz\", doesn't exactly convey.",
    "image": "https://images05.military.com/sites/default/files/styles/full/public/2020-03/vikings-ragnar1200.jpg"
  },
  "4": {
    "name": "Bjorn Ironside",
    "info": "He was a legendary Swedish king who may be familiar to fans of Vikings on the History Channel. Bjorn was the son of Ragnar Lothbrok and was renowned for the raids he led on France, England and along the Mediterranean coastline.",
    "image": "https://www.ancient.eu/img/c/p/1200x627/9654.jpg"
  },
  "5": {
    "name": "Gunnar Hamundarson",
    "info": "Famed for his swordsmanship, Gunnar was, according to most accounts, a truly formidable fighter whose jump could exceed his own height - even when he was wearing full armour. He fought and pillaged his way along the coasts of Denmark and Norway and features in the Brennu-Njals saga.",
    "image": "https://images.fineartamerica.com/images/artworkimages/mediumlarge/1/gunnar-hamundarson-arturas-slapsys.jpg"
  },
  "6": {
    "name": "Ivar the Boneless",
    "info": "A son of Ragnar Lothbrok, Ivar supposedly owes his nickname to a condition that caused his legs to fracture easily, makeing his fearsome reputation all the more impressive. Indeed, Ivar the Boneless was known to be a Berserker, champion Norse warriors who fought in a trance-like fury. He is best known for invading several Anglo-Saxon kingdoms with his two brothers.",
    "image": "https://images05.military.com/sites/default/files/styles/full/public/2020-04/mightyragnarlead.jpg"
  },
  "7": {
    "name": "Eric Bloodaxe",
    "info": "Born into the Viking lifestyle, Eric Bloodaxe was one of the many sons of Norway's first king, Harald Fairhair. He is said to have participated in bloody raids across Europe from the age of 12 and quickly learnt that violence was the most effective way to distinguish yourself in the Viking community. Eric, whose real name was in fact Eric Haraldsson, gained his evocative nickname by murdering all but one of his brothers.",
    "image": "https://2.bp.blogspot.com/-eDmMgeGiT44/WmpzQlZXkbI/AAAAAAAAGDU/kW119PyVy1wYfdzj16Hqge4PGcc_AgMiwCLcBGAs/s1600/Viking%2Bready%2Bfor%2Bbattle.jpg"
  },
  "8": {
    "name": "Egil Skallagrimsson",
    "info": "The archetypal warrior-poet, our knowledge of Egil Skallagrimsson and his exploits owes much to legend. Nonetheless, even given the sagas' tendency towards drama and aggrandisement, Egil was a remarkable character.\nEgil's Saga portrays him as a complex man who was prone to violent rage but also capable of great poetic sensitivity. Indeed, his poems are widely considered to be among ancient Scandinavia's finest.  Egil is said to have killed for the first time when he was just seven, taking an axe to another boy. It was the first murderous act of a bloody life filled with pillaging and plundering.",
    "image": "https://i0.wp.com/www.runestone.org/wp-content/uploads/2018/12/Egil.jpg"
  },
  "9": {
    "name": "Harald Hardrada",
    "info": "Hardrada translates as \"hard ruler\", a reputation Harald lived up to with his aggressively militaristic approach to leadership and tendency to settle disputes brutally. He is widely considered to have been the last great Viking ruler, taking the Norwegian throne in 1046 and presiding over a period of peace and progress - and the introduction of Christianity that rather belies his fierce reputation.\nHe died at the Battle of Stamford Bridge in England when his invading Viking army was defeated by King Harold's surprise attack. Famously he was killed by an arrow to the neck.",
    "image": "https://2.bp.blogspot.com/-sFMu4y1nSXg/Wj_1Hs7M1KI/AAAAAAAABdM/nehkOuwE_qcA41xiJh8-5ery1k4kVUQHwCLcBGAs/s1600/harald-hardrada-arturas-slapsys.jpg"
  }
}